export const ArticlesData = [
  {
    id: "1",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "3",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "4",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "2",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "13",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "14",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "1500",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "15",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "16",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "17",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "18",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "19",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "20",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "21",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "22",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "23",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "24",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "25",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "26",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "27",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "28",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "29",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "30",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
  {
    id: "31",
    image: "/images/article.png",
    title: "نحوه نگهداری سانسوریا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.صنعت چاپ و با استفاده از طراحان گرافیک است.",
  },
];

export async function getArticlesById(id) {
  return ArticlesData.find((item) => +item.id == +id);
}
